#include <LiquidCrystal.h>

void chars_setup ();

/*
Название букв
rus_1 - Л
rus_2 - Ч
rus_3 - И
rus_4 - У
rus_5 - П
rus_6 - Ю
rus_7 - Ж
rus_0 - Д
*/

/* Так как коды наших собственных символов - от 0 до 7,
 можно смело использовать запись символов в строке при помощи
 восьмеричных кодов: \1, \2 и т.д.
 НО: код 0 (ноль) в C и C++ используется в качестве маркера конца строки,
 так что используйте lcd.print(char(0)) для вывода нулевого символа.
 */


byte rus_1[8] = {//Л
  0b00111,
  0b01001,
  0b01001,
  0b01001,
  0b01001,
  0b01001,
  0b10001,
  0b00000
};

byte rus_2[8] = {//Ч
  0b10001,
  0b10001,
  0b10001,
  0b01111,
  0b00001,
  0b00001,
  0b00001,
  0b00000
};


byte rus_3[8] = { //И
  0b10001,
  0b10001,
  0b10001,
  0b10011,
  0b10101,
  0b11001,
  0b10001,
  0b00000
};


byte rus_4[8] = {//У
  0b10001,
  0b10001,
  0b10001,
  0b01111,
  0b00001,
  0b10001,
  0b01110,
  0b00000
};

byte rus_5[8] = {//П
  0b01111,
  0b01001,
  0b01001,
  0b01001,
  0b01001,
  0b01001,
  0b01001,
  0b00000
};


byte rus_6[8] = {//Ю
  0b10010,
  0b10101,
  0b10101,
  0b11101,
  0b10101,
  0b10101,
  0b10010,
  0b00000
};

byte rus_7[8] = {//Ж
  0b10101,
  0b10101,
  0b10101,
  0b01110,
  0b10101,
  0b10101,
  0b10101,
  0b00000
};

byte rus_0[8] = {//Д
  0b00110,
  0b01010,
  0b01010,
  0b01010,
  0b01010,
  0b01010,
  0b11111,
  0b10001
};

/*const byte rus_Z[8] PROGMEM = {//З
  0b01110,
  0b10001,
  0b00001,
  0b00110,
  0b00001,
  0b10001,
  0b01110,
  0b00000
};*/
